#!/bin/python
# 第9周程序题3——使用唐诗高频词汇随机生成一句五言诗
import random

string = "东风倚阑干不知何处到如今何处知何处不如归去君知否人间广寒宫人间天上谁知道风流到如今明月清风功名事春" \
         "风东风吹广寒宫殿须信道归去留不住归去来兮最好是西风人何处落花流水人间世归来有谁知绿鬓朱颜从今去江南" \
         "西风吹落花飞絮凝伫相思三十六人间何处归去梅花云深处去年今日不如归去千里不知何天上人间知否多少与谁同" \
         "江南江北谁信道如今君知否十洲三岛倚阑干明月人不见朝朝暮暮到而今回首人千里清风明月又还是阑干不如归疏" \
         "影横斜归去来兮年年人间世一觞一咏人不见万里春归去三十六宫当此际一笑何处是独倚阑干记当年黄昏年今日一" \
         "轮明月东风里当年归何处三万六千怎奈向相逢江南春五云深处春去也天涯花流水功名富贵须知道一枝花深处岁岁" \
         "年年争知道尊前二十四朱颜绿鬓更那堪芳草向尊前良辰美景留不住风雨归去来不堪回首谩赢得风吹雨初晴暗香浮" \
         "动那堪更流水长安道冰肌玉骨一觞一咏依旧海棠开十二阑干休休风月花飞絮嫣然一笑君不见多情那堪更寒食清明" \
         "家山好无人东风里江北江南归来也故人倚东风满城风雨思往事当时山无数竹篱茅舍悠悠不见断人肠钱塘江上无绪" \
         "斜阳海棠花一钩新月还知否不知记当年二十四桥追往事深处功名事玉皇香案人间天上时节水晶宫百花头上最苦是" \
         "春色知多少纶巾羽扇疏影横斜凄凉谁知道一年春事空怅望匆匆如归去夜来风雨空惆怅平生桥流水故人何处记年时"
strlen = len(string)
seed = eval(input())
random.seed(seed)
result = ""
for row in range(0, 4):
    for col in range(0, 5):
        result += string[random.randint(0, strlen)]
    result += "\n"
print(result)
